public/consultaRequest_12345678_10-12-2024.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.proxy.deceval.com/">
        <soapenv:Header/>
        <soapenv:Body>
           <ser:consultarPagares>
              <!--Optional:-->
              <arg0>
                 <!--Optional:-->
                 <consultaPagareServiceDTO>
                    <!--Optional:-->
                    <codigoDeceval>TEST</codigoDeceval>
                    <!--Optional:-->
                    <idTipoIdentificacionFirmante>1</idTipoIdentificacionFirmante>
                    <!--Optional:-->
                    <numIdentificacionFirmante>12345678</numIdentificacionFirmante>
                    <!--Optional:-->
                    <numPagareEntidad>12345</numPagareEntidad>
                 </consultaPagareServiceDTO>
                 <!--Optional:-->
                 <header>
                    <!--Optional:-->
                    <codigoDepositante/>
                    <!--Optional:-->
                    <fecha>2024-12-10T11:28:11</fecha>
                    <!--Optional:-->
                    <hora>11:28:11</hora>
                    <!--Optional:-->
                    <usuario/>
                 </header>
              </arg0>
           </ser:consultarPagares>
        </soapenv:Body>
     </soapenv:Envelope>
